emacs.org
:PROPERTIES:
:header-args: :mkdirp yes
:header-args:emacs-lisp: :tangle stow/emacs/.config/emacs/init.el :lexical yes
:END:
#+TITLE: Emacs

* Header
Enable lexical binding. When visiting the tangled file, enable read
only mode.

#+BEGIN_SRC emacs-lisp
  ;;; init.el --- Nicolas' Emacs configuration -*- lexical-binding: t; buffer-read-only: t; -*-

  ;;; Commentary:

  ;; Nicolas' Emacs configuration.

  ;;; Code:
#+END_SRC

Increasing cons threshold makes garbage collection more efficient and
decreasing it makes garbage collection less noticeable, i.e., a cons
threshold x freezes Emacs longer than half x collected one time but
shorter than half x collected two times. Increase cons threshold
during initialization. Reduces startup time.

#+BEGIN_SRC emacs-lisp :tangle stow/emacs/.config/emacs/early-init.el
  (setq gc-cons-threshold (* (expt 1024 2) 128)) ; In bytes
#+END_SRC

Once initialized, [[*gcmh - Collect garbage when idle][gcmh]] kicks in.

Require libraries.

#+BEGIN_SRC emacs-lisp
  (require 'subr-x)
  (require 'seq)
#+END_SRC

* Bootstrap

** nsm - Network security manager
No-littering requires straight which requires nsm. Set location of
settings file manually.

#+BEGIN_SRC emacs-lisp
  (require 'nsm)

  (setq nsm-settings-file
        (expand-file-name "var/nsm-settings.el" user-emacs-directory))
  (setq network-security-level 'high)
#+END_SRC

** straight - Package manager
[[https://github.com/raxod502/straight.el][straight (GitHub)]]

Disable builtin package manager.

#+BEGIN_SRC emacs-lisp :tangle stow/emacs/.config/emacs/early-init.el
  (setq package-enable-at-startup nil)
#+END_SRC

Straight can install any commit of any Git repository, it's not
limited to what's available in a package archive. Configure straight.

#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)              ; Must be a dynamic variable

  (setq straight-check-for-modifications '(check-on-save find-when-checking))

  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el"
                           user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+END_SRC

** no-littering - Normalize configuration and data paths packages
[[https://github.com/emacscollective/no-littering][no-littering (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (straight-use-package 'no-littering)
  (require 'no-littering)
#+END_SRC

** use-package - Package configuration macro
[[https://github.com/jwiegley/use-package][use-package (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
  (straight-use-package 'delight)         ; Optional dependency
  (eval-when-compile
    (require 'use-package))
  (require 'bind-key)
#+END_SRC

** org - Notes, to-do lists and project planning
Installing latest org after loading builtin org breaks org. Install
latest org before loading org.

#+BEGIN_SRC emacs-lisp
  (straight-use-package 'org-plus-contrib)
#+END_SRC

Org is a subset of org-plus-contrib. Packages depending on org will
cause org to be installed even when org-plus-contrib is installed.
Prevent packages from installing org.

#+BEGIN_SRC emacs-lisp
  (straight-use-package '(org :type built-in))
#+END_SRC

For org configuration, see [[*Org][Org]].

* Files

** dired - File manager
#+BEGIN_SRC emacs-lisp
  (use-package dired
    :bind
    ("C-c f f" . dired)
    :hook (dired-mode . dired-hide-details-mode)
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (let* ((safe "-lah") ; For safe switches, see `ls-lisp--insert-directory'
           (unsafe (concat safe " --group-directories-first")))
      (setq dired-listing-switches
            (or (and (executable-find "ls") unsafe) safe))))

  (use-package dired-aux
    :after dired
    :config
    (setq dired-vc-rename-file t)
    (setq dired-dwim-target #'dired-dwim-target-recent)
    (setq dired-create-destination-dirs 'ask))

  (use-package dired-x
    :after dired
    :bind
    ("C-c f C-f" . dired-jump))
#+END_SRC

*** diredfl - Visualize file properties
[[https://github.com/purcell/diredfl][diredfl (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package diredfl
    :straight t
    :after dired
    :config
    (diredfl-global-mode))
#+END_SRC

** Trash
Move deleted files to trash.

#+BEGIN_SRC emacs-lisp
  (setq delete-by-moving-to-trash t)
#+END_SRC

** projectile - Projects
[[https://github.com/bbatsov/projectile][projectile (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :straight t
    :demand t
    :bind
    (:map projectile-command-map
     ("x t" . projectile-run-vterm))
    :preface
    (defun koek-proj/forgetp (file-name)
      "Return whether project with root FILE-NAME should be forgotten."
      (not (recentf-include-p file-name)))
    :config
    (define-key projectile-mode-map (kbd "C-c p") projectile-command-map)

    (setq projectile-ignored-project-function #'koek-proj/forgetp)
    (setq projectile-completion-system 'ivy)
    (projectile-mode)
    :delight)
#+END_SRC

** vc - Version control
VC is a placeholder.

#+BEGIN_SRC emacs-lisp
  (use-package vc-hooks
    :defer t
    :config
    (setq vc-follow-symlinks t))
#+END_SRC

** magit - Git
[[https://github.com/magit/magit][magit (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package magit-status
    :straight magit
    :bind
    ("C-c f g" . magit-status))

  (use-package magit-log
    :bind
    ("C-c f h" . magit-log-buffer-file))

  (use-package git-commit
    :defer t
    :preface
    (defun koek-git/check-spelling (force)
      "Check spelling of commit message.
  When FORCE is truthy, continue commit unconditionally."
      (let ((tick (buffer-chars-modified-tick))
            (result
             (let ((ispell-skip-region-alist ; Dynamic variable
                    (cons (list (rx line-start "#") #'forward-line) ; Comment
                          ispell-skip-region-alist)))
               (ispell-buffer))))
        (cond
         (force
          t)
         ;; When spell check was completed, result is truthy
         (result
          ;; When nothing was corrected, character tick counter is
          ;; unchanged
          (or (= (buffer-chars-modified-tick) tick)
              (y-or-n-p "Spelling checked.  Commit? "))))))
    :config
    (add-hook 'git-commit-finish-query-functions #'koek-git/check-spelling))
#+END_SRC

** ediff - Diff viewer
#+BEGIN_SRC emacs-lisp
  (use-package ediff
    :bind
    (("C-c f d" . ediff-files)
     ("C-c f b" . ediff-current-file))
    :preface
    (defface koek-diff/variant '((t :inherit mode-line-emphasis))
      "Face for variant label in mode line."
      :group 'ediff))

  (use-package ediff-init
    :defer t
    :preface
    (defun koek-diff/unfold-outline ()
      "Unfold outline in outline and derived modes."
      (when (derived-mode-p 'outline-mode) ; org is derived from outline
        (outline-show-all)))
    :config
    ;; Restore window layout on quit
    (let (last-layout)
      ;; Store window layout before it's modified. Control buffer
      ;; doesn't exist yet.
      (add-hook 'ediff-before-setup-hook
                (lambda ()
                  (setq last-layout (current-window-configuration))))
      ;; Store window layout in a local hook of control buffer. Current
      ;; is control buffer.
      (add-hook 'ediff-mode-hook
                (lambda ()
                  (let ((layout last-layout))
                    ;; Restore window layout
                    (add-hook 'ediff-quit-hook
                              (lambda ()
                                (set-window-configuration layout))
                              'append 'local)))))

    (add-hook 'ediff-prepare-buffer-hook #'koek-diff/unfold-outline))

  (use-package ediff-wind
    :defer t
    :config
    (setq ediff-grab-mouse nil)
    (setq ediff-window-setup-function #'ediff-setup-windows-plain)
    (setq ediff-split-window-function #'split-window-right))
#+END_SRC

** autorevert - Revert file on external change
#+BEGIN_SRC emacs-lisp
  (use-package autorevert
    :config
    (global-auto-revert-mode)
    :delight auto-revert-mode)
#+END_SRC

** recentf - Recent files
#+BEGIN_SRC emacs-lisp
  (use-package recentf
    :config
    (require 'find-func)
    (let ((file-names
           (list
            (rx line-start
                (literal (locate-dominating-file (find-library-name "files")
                                                 emacs-version)))
            ;; True and symbolic file name variants
            (regexp-quote (file-relative-name user-emacs-directory "~/")))))
      (setq recentf-exclude (append file-names recentf-exclude)))
    (recentf-mode))
#+END_SRC

** saveplace - Restore point on revisit
#+BEGIN_SRC emacs-lisp
  (use-package saveplace
    :config
    (save-place-mode))
#+END_SRC

** Auto save files
Save auto-save files in =~/.emacs.d/var/auto-save/=.

#+BEGIN_SRC emacs-lisp
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+END_SRC

* Editor

** swiper - isearch replacement
[[https://github.com/abo-abo/swiper][swiper (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :straight t
    :bind
    ;; Why does [remap isearch-forward] prevent pdf-view-mode from
    ;; rebinding C-s?
    (("C-s" . swiper-isearch)
     :map swiper-map
     ("C-c j" . swiper-avy)))
#+END_SRC

** avy - Jump to visible position
[[https://github.com/abo-abo/avy][avy (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package avy
    :straight t
    :bind
    (("C-c j j" . avy-goto-char-timer)
     ([remap goto-line] . avy-goto-line))
    :config
    (setq avy-all-windows nil)
    (setq avy-all-windows-alt 'all-frames)
    (setq avy-keys '(?q ?s ?d ?f ?j ?k ?l ?m))
    (setq avy-dispatch-alist nil))
#+END_SRC

*** link-hint - Jump to visible link
[[https://github.com/noctuid/link-hint.el][link-hint (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package link-hint
    :straight t
    :bind
    ("C-c j l" . link-hint-open-link)
    :preface
    (defun koek-lh/next-dictionary-link (limit)
      "Return position of next dictionary link.
  LIMIT is a position, a search limit limiting dictionary links to
  dictionary links before LIMIT."
      (link-hint--next-property 'link limit))

    (defun koek-lh/point-at-dictionary-link-p ()
      "Return whether point is at a dictionary link."
      (get-text-property (point) 'link))

    (defun koek-lh/dictionary-mode-p ()
      "Return whether current major mode is derived from dictionary-mode."
      (derived-mode-p 'dictionary-mode))

    (defun koek-lh/open-dictionary-link ()
      "Open dictionary link at point."
      (link-selected))
    :config
    (link-hint-define-type 'dictionary-link
      :next #'koek-lh/next-dictionary-link
      :at-point-p #'koek-lh/point-at-dictionary-link-p
      ;; dictionary-mode doesn't bind the symbol dictionary-mode
      :predicates (list #'koek-lh/dictionary-mode-p)
      :open #'koek-lh/open-dictionary-link)
    (push 'link-hint-dictionary-link link-hint-types))
#+END_SRC

** Jump to recent mark positions
When popping mark, skip consecutive identical marks.

#+BEGIN_SRC emacs-lisp
  (define-advice pop-to-mark-command (:around (f) koek-mark/ensure-move)
    (let ((start (point))
          (n (length mark-ring)))
      ;; Move point to current mark
      (funcall f)
      ;; Move point to previous marks in mark ring
      (while (and (= (point) start) (> n 0))
        (funcall f)
        (setq n (1- n)))))
#+END_SRC

** Edit commands
Bind sort and align region.

#+BEGIN_SRC emacs-lisp
  (bind-keys
   ("C-c e s" . sort-lines)
   ("C-c e a" . align-regexp))
#+END_SRC

Upgrade case commands.

#+BEGIN_SRC emacs-lisp
  (bind-keys
   ([remap downcase-word]   . downcase-dwim)
   ([remap upcase-word]     . upcase-dwim)
   ([remap capitalize-word] . capitalize-dwim))
#+END_SRC

** expand-region - Mark increasingly larger unit
[[https://github.com/magnars/expand-region.el][expand-region (GitHub)]]

#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :straight t
    :bind
    ("C-S-SPC" . er/expand-region)
    :config
    (setq expand-region-smart-cursor t))
#+END_SRC

** subword - Recognize words in camel case words
#+BEGIN_SRC emacs-lisp
  (use-package subword
    :hook
    ((prog-mode conf-mode eshell-mode comint-mode cider-repl-mode indium-repl-mode) .
     subword-mode)
    :delight)
#+END_SRC

** Word motion commands
Complement word motion commands. Unlike ~forward-to-word~ and
~backward-to-word~, ~koek-mtn/next-word~ and ~koek-mtn/previous-word~
recognize [[*subword - Recognize words in camel case words][subwords]].

#+BEGIN_SRC emacs-lisp
  (defun koek-mtn/next-word (&optional arg)
    "Move point to beginning of next word, repeat ARG times.
  Optional ARG is an integer and defaults to one.  When ARG is
  negative, move point to ending of previous word."
    (interactive "p")
    (unless arg
      (setq arg 1))
    (unless (= arg 0)
      (let ((step (/ arg (abs arg))))
        (when (or (and (> step 0) (looking-at (rx word)))
                  (and (< step 0)
                       (looking-back (rx word) (max (1- (point)) (point-min)))))
          (forward-word step))
        (forward-word (- arg step))
        (when (forward-word step)
          (backward-word step)))))

  (defun koek-mtn/previous-word (&optional arg)
    "Move point to ending of previous word, repeat ARG times.
  Optional ARG is an integer and defaults to one.  When ARG is
  negative, move point to beginning of next word."
    (interactive "p")
    (unless arg
      (setq arg 1))
    (koek-mtn/next-word (- arg)))

  (bind-keys
   ("M-n" . koek-mtn/next-word)
   ("M-p" . koek-mtn/previous-word))
#+END_SRC

** auto-fill - Break long sentences
#+BEGIN_SRC emacs-lisp
  (defvar koek-af/excluded-modes '(snippet-mode)
    "List of major mode symbols, see `koek-af/maybe-enable'.")

  (defun koek-af/maybe-enable ()
    "Enable `auto-fill-mode' conditionally.
  Unless current major mode is member of `koek-af/excluded-modes',
  enable `auto-fill-mode'."
    (unless (memq major-mode koek-af/excluded-modes)
      (auto-fill-mode)))

  (add-hook 'text-mode-hook #'koek-af/maybe-enable)
  (delight 'auto-fill-function nil 'simple)
#+END_SRC

