stow/emacs/.config/emacs/early-init.el
(setq gc-cons-threshold (* (expt 1024 2) 128)) ; In bytes

(setq package-enable-at-startup nil)
