emacs.org
* Appearance
Maximize frames. Configuring this during early initialization reduces
startup time.

#+BEGIN_SRC emacs-lisp :tangle stow/emacs/.config/emacs/early-init.el
  (push '(fullscreen . maximized) default-frame-alist)
#+END_SRC

Show file name in title bar.

#+BEGIN_SRC emacs-lisp
  (setq frame-title-format
        '((:eval
           ;; Resolve conflict between `file-truename' and
           ;; `query-replace', see
           ;; https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33697
           (save-match-data
             (let ((file-name (buffer-file-name)))
               (cond
                ((and (projectile-project-p) file-name)
                 (format "~%s/%s"
                         (projectile-project-name)
                         (file-relative-name (file-truename file-name)
                                             (projectile-project-root))))
                (file-name
                 (abbreviate-file-name file-name))
                (t
                 "%b")))))
          " - Emacs"))
#+END_SRC

Disable menu bar, tool bar and scroll bars. Configuring this during
early initialization reduces startup time.

#+BEGIN_SRC emacs-lisp :tangle stow/emacs/.config/emacs/early-init.el
  ;; Prefer setting frame parameters to disabling menu-bar-mode,
  ;; tool-bar-mode and scroll-bar-mode during early initialization
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
#+END_SRC

Load [[https://protesilaos.com/modus-themes/][Modus]] theme.

#+BEGIN_SRC emacs-lisp
  (defvar koek-thm/load-hook nil
    "Normal hook run after loading theme.")

  (define-advice load-theme (:after (&rest _args) koek-thm/run-load-hooks)
    (run-hooks 'koek-thm/load-hook))

  (defvar koek-thm/dark-themes nil
    "List of theme symbols, see `koek-thm/set-frame-theme-variant'.")

  (defun koek-thm/set-frame-theme-variant (frame)
    "Set theme variant of FRAME.
  When current theme is member of `koek-thm/dark-themes', set frame
  theme variant to dark, else, clear frame theme variant."
    (when (fboundp 'koek-thm/set-frame-theme-variant-xprop)
      (koek-thm/set-frame-theme-variant-xprop frame)))

  (when (executable-find "xprop")
    (defun koek-thm/set-frame-theme-variant-xprop (frame)
      "Set theme variant of FRAME.
  Mustn't be called directly, see
  `koek-thm/set-frame-theme-variant'."
      (make-process
       :name "xprop"
       :command
       `("xprop"
         "-id" ,(frame-parameter frame 'outer-window-id)
         "-f" "_GTK_THEME_VARIANT" "8u"
         "-set" "_GTK_THEME_VARIANT"
         ,(or (and (member (car custom-enabled-themes) koek-thm/dark-themes) "dark")
              "")))))

  (defun koek-thm/update-frame-theme-variant ()
    "Update theme variant of all frames."
    (mapc #'koek-thm/set-frame-theme-variant (frame-list)))

  (add-hook 'after-make-frame-functions #'koek-thm/set-frame-theme-variant)
  (add-hook 'koek-thm/load-hook #'koek-thm/update-frame-theme-variant)

  (use-package modus-operandi-theme
    :straight t
    :defer t
    :init
    (setq modus-operandi-theme-bold-constructs t)
    (setq modus-operandi-theme-slanted-constructs t)
    (setq modus-operandi-theme-mode-line 'moody)
    (setq modus-operandi-theme-headings '((t . section)))
    (setq modus-operandi-theme-variable-pitch-headings t)
    (setq modus-operandi-theme-scale-headings t)
    (setq modus-operandi-theme-org-blocks 'greyscale))

  (use-package modus-vivendi-theme
    :straight t
    :defer t
    :init
    (setq modus-vivendi-theme-bold-constructs t)
    (setq modus-vivendi-theme-slanted-constructs t)
    (setq modus-vivendi-theme-mode-line 'moody)
    (setq modus-vivendi-theme-headings '((t . section)))
    (setq modus-vivendi-theme-variable-pitch-headings t)
    (setq modus-vivendi-theme-scale-headings t)
    (setq modus-vivendi-theme-org-blocks 'greyscale)
    (push 'modus-vivendi koek-thm/dark-themes))

  (defmacro koek-thm/with-modus-vars (variant &rest body)
    "Evaluate BODY with variables of Modus theme variant VARIANT bound.
  VARIANT is a symbol, the Modus theme variant, either operandi or
  vivendi."
    (declare (indent 1))
    `(if (eq ,variant 'operandi)
         (modus-operandi-theme-with-color-variables
          ,@body)
       (modus-vivendi-theme-with-color-variables
         ,@body)))

  (defun koek-thm/load-modus (variant)
    "Load and enable Modus theme.
  VARIANT is a symbol, the Modus theme variant, either operandi or
  vivendi."
    (let ((koek-thm/load-hook nil)        ; Dynamic variable
          (theme (or (and (eq variant 'operandi) 'modus-operandi)
                     'modus-vivendi)))
      (unless (member theme custom-known-themes)
        ;; load-theme will load a theme even when it's already loaded
        (load-theme theme 'no-confirm 'no-enable))
      (mapc #'disable-theme custom-enabled-themes)
      (enable-theme theme)
      (koek-thm/with-modus-vars variant
        (custom-set-faces
         `(koek-diff/variant            ((,class :inherit bold)))
         `(eyebrowse-mode-line-active   ((,class :foreground unspecified)))
         `(eyebrowse-mode-line-inactive ((,class :foreground ,bg-alt)))
         `(koek-wm/floating-border      ((,class :foreground ,fg-window-divider-inner)))
         `(koek-wm/selected-workspace   ((,class :inherit bold)))
         `(koek-wm/unselected-workspace ((,class :foreground ,bg-alt)))
         `(koek-pdf/midnight            ((,class :foreground ,fg-main :background ,bg-main))))))
    (run-hooks 'koek-thm/load-hook))

  (defun koek-thm/toggle-modus-variant ()
    "Toggle Modus theme variant."
    (interactive)
    (koek-thm/load-modus
     (or (and (eq (car custom-enabled-themes) 'modus-operandi) 'vivendi)
         'operandi)))

  (setq face-near-same-color-threshold 45000)
  (koek-thm/load-modus 'vivendi)
#+END_SRC

Set fonts. Try [[https://www.fsd.it/shop/fonts/pragmatapro/][PragmataPro Mono]] or [[https://typeof.net/Iosevka/][Iosevka]] for fixed pitch and [[https://www.ibm.com/plex/][IBM
Plex]] for variable pitch.

#+BEGIN_SRC emacs-lisp
  (defvar koek-font/pairs
    '(((:family "PragmataPro Mono Liga" :height 110)
       (:family "IBM Plex Sans" :height 1.0))
      ((:family "Iosevka" :height 110)
       (:family "IBM Plex Sans" :height 1.0)))
    "List of font pairs.
  A font pair is a list of two font specifications, one for fixed
  pitch and one for variable pitch faces.  A font specification is
  a plist of face attributes, see `set-face-attribute'.  Both font
  specifications must set the family face attribute.  The fixed
  pitch font specification must set an absolute height, the
  variable pitch optionally a relative height.")

  (when-let* ((pair
               (let ((families (seq-uniq (font-family-list))))
                 (seq-find
                  (lambda (pair)
                    (seq-every-p (lambda (attrs)
                                   (member (plist-get attrs :family) families))
                                 pair))
                  koek-font/pairs)))
              (fixed (car pair))
              (variable (cadr pair)))
    (apply #'set-face-attribute 'default nil fixed)
    (apply #'set-face-attribute
           'fixed-pitch nil (plist-put (copy-sequence fixed) :height 1.0))
    (apply #'set-face-attribute 'variable-pitch nil variable))
#+END_SRC

Show vertical divider between windows. The default divider is drawn in
the left fringe of the right window, the ~window-divider-mode~ divider
is drawn between windows.

#+BEGIN_SRC emacs-lisp
  (setq window-divider-default-right-width 1)
  (window-divider-mode)
#+END_SRC

Set mode line. Style it with [[https://github.com/tarsius/moody][moody]].

#+BEGIN_SRC emacs-lisp
  (use-package moody
    :straight t
    :preface
    (defconst koek-ml/separator (make-string 3 ?\s)
      "Mode line group separator.")

    (defconst koek-ml/large-separator
      (make-string (* (length koek-ml/separator) 5) ?\s)
      "Mode line left right separator.")

    (defconst koek-ml/dummies '((eldoc-mode-line-string nil))
      "Dummies mode line construct.
  A dummy prevents a package from modifying the mode line.")

    (defconst koek-ml/eldoc
      '(eldoc-mode-line-string ("" eldoc-mode-line-string koek-ml/separator))
      "Eldoc mode line construct.")

    (defun koek-ml/get-window-label ()
      "Return window label of selected window."
      (substring-no-properties (window-parameter nil 'ace-window-path)))

    (defconst koek-ml/ace
      '(:eval
        (when (bound-and-true-p ace-window-mode)
          `(,(moody-ribbon
              (propertize (koek-ml/get-window-label) 'face 'aw-mode-line-face)
              nil 'up)
            koek-ml/separator)))
      "Ace mode line construct.")

    (defvar-local koek-ml/variant nil
      "Ediff variant.")

    (defconst koek-ml/ediff
      '(:eval
        (when koek-ml/variant
          `(,(moody-ribbon
              (concat (propertize (plist-get koek-ml/variant :label)
                                  'face 'koek-diff/variant)
                      (when-let ((state (plist-get koek-ml/variant :state)))
                        (concat ":" state)))
              nil 'up)
            koek-ml/separator)))
      "Ediff mode line construct.")

    (defconst koek-ml/depth
      '(:eval
        (let ((depth (- (recursion-depth) (minibuffer-depth))))
          (when (and (> depth 0) (moody-window-active-p))
            `(,(moody-ribbon (format "[%d]" depth) nil 'up)
              koek-ml/separator))))
      "Recursive edit depth mode line construct.")

    (defvar koek-ml/roman-numerals
      '((9 . "IX")
        (5 . "V")
        (4 . "IV")
        (1 . "I"))
      "Alist of sorted Arabic numeral to Roman numeral pairs.")

    (defun koek-ml/arabic-to-roman (n &optional roman-numerals)
      "Convert Arabic number N to a Roman number.
  N is an integer greater than zero.  ROMAN-NUMERALS is used
  internally."
      (unless roman-numerals
        (setq roman-numerals koek-ml/roman-numerals))
      (when (> n 0)
        (pcase-let ((`(,arabic . ,roman) (car roman-numerals)))
          (if (>= n arabic)
              (concat roman (koek-ml/arabic-to-roman (- n arabic) roman-numerals))
            (koek-ml/arabic-to-roman n (cdr roman-numerals))))))

    (defun koek-ml/get-exwm-workspaces ()
      "Return workspaces of selected monitor."
      (thread-last (number-sequence 0 (1- (length exwm-workspace--workareas)))
        (seq-group-by (lambda (n)
                        (nth n exwm-workspace--workareas)))
        (mapcar #'cdr)
        (seq-find (lambda (ns)
                    (member exwm-workspace-current-index ns)))
        (mapcar (lambda (n)
                  (list :n n :label (or (koek-ml/arabic-to-roman n) "N"))))))

    (defconst koek-ml/exwm-workspaces
      '(:eval
        (when (and (boundp 'exwm-workspace-current-index) (moody-window-active-p))
          (let ((workspaces (koek-ml/get-exwm-workspaces)))
            (when (> (length workspaces) 1)
              `(,(moody-ribbon
                  (mapconcat
                   (lambda (workspace)
                     (let ((face (if (= (plist-get workspace :n)
                                        exwm-workspace-current-index)
                                     'koek-wm/selected-workspace
                                   'koek-wm/unselected-workspace)))
                       (propertize (plist-get workspace :label) 'face face)))
                   workspaces " ")
                  nil 'up)
                koek-ml/separator)))))
      "Exwm workspaces mode line construct.")

    (defun koek-ml/get-eyebrowse-workspaces ()
      "Return workspaces of selected frame."
      (mapcar (lambda (workspace)
                (let ((n (nth 0 workspace))
                      (name (let ((name (nth 2 workspace)))
                              (unless (string= name "")
                                name))))
                  (list :n n
                        :label (concat (or (koek-ml/arabic-to-roman n) "N")
                                       (when name
                                         (concat ":" name))))))
              (eyebrowse--get 'window-configs)))

    (defconst koek-ml/eyebrowse
      '(:eval
        (when (and (bound-and-true-p eyebrowse-mode) (moody-window-active-p))
          (let ((workspaces (koek-ml/get-eyebrowse-workspaces))
                (selected-n (eyebrowse--get 'current-slot)))
            (when (or (> (length workspaces) 1) (not (= selected-n 0)))
              `(,(moody-ribbon
                  (mapconcat
                   (lambda (workspace)
                     (let ((face (if (= (plist-get workspace :n) selected-n)
                                     'eyebrowse-mode-line-active
                                   'eyebrowse-mode-line-inactive)))
                       (propertize (plist-get workspace :label) 'face face)))
                   workspaces " ")
                  nil 'up)
                koek-ml/separator)))))
      "Eyebrowse mode line construct.")

    (defun koek-ml/truncate (s length)
      "Truncate string S to LENGTH.
  S is a string, the string to truncate.  LENGTH is an integer, the
  maximum length of S."
      (substring s 0 (min length (length s))))

    (defconst koek-ml/id
      '(:eval
        (moody-tab
         (concat (when (and (projectile-project-p) (derived-mode-p 'prog-mode))
                   (concat (koek-ml/truncate (projectile-project-name) 16) "/"))
                 (propertize (koek-ml/truncate (buffer-name) 32)
                             'face 'mode-line-buffer-id))))
      "Id mode line construct.")

    (defconst koek-ml/state '(" " "%*%+")
      "State mode line construct.")

    (defconst koek-ml/keycast
      '(:eval
        (when (bound-and-true-p keycast-mode)
          mode-line-keycast))
      "Keycast mode line construct.")

    (defconst koek-ml/position
      '(:eval
        (unless (derived-mode-p 'pdf-view-mode)
          `("" koek-ml/large-separator
            ,(when (buffer-narrowed-p)
               (list (moody-ribbon "Narrowed" nil 'up) " "))
            "%p" " " "%l,%c")))
      "Position mode line construct.")

    (defconst koek-ml/pdf
      '(:eval
        (when (derived-mode-p 'pdf-view-mode)
          `("" koek-ml/large-separator
            ,(format "%d/%d"
                     (pdf-view-current-page) (pdf-cache-number-of-pages)))))
      "PDF-tools mode line construct.")

    (defconst koek-ml/exwm-input
      '(:eval
        (when (and (boundp 'exwm--input-mode) (eq exwm--input-mode 'char-mode)
                   (moody-window-active-p))
          `("" koek-ml/separator
            ,(moody-ribbon "Char" nil 'up))))
      "Exwm input mode line construct.")

    (defconst koek-ml/input
      '(:eval
        (when (and current-input-method (moody-window-active-p))
          `("" koek-ml/separator
            ,(moody-ribbon current-input-method-title nil 'up))))
      "Input mode line construct.")

    (defvar koek-ml/checker-names
      '((eglot-flymake-backend . "LSP")
        (elisp-flymake-byte-compile . "El")
        (elisp-flymake-checkdoc . "CDoc"))
      "Alist of checker symbol to checker name pairs.")

    (defun koek-ml/state-to-description (state)
      "Convert checker state STATE to a description.
  STATE is a symbol, a flymake state."
      (let ((words (split-string (symbol-name state) "-")))
        (string-join (cons (capitalize (car words)) (cdr words)) " ")))

    (defun koek-ml/get-flymake-state ()
      "Return state of flymake.
  State is the symbol running (some checkers running),
  finished (all checkers finished running), all-disabled (all
  compatible checkers disabled) or no-checker (no compatible
  checkers)."
      (let* ((enabled (flymake-running-backends))
             (finished (flymake-reporting-backends))
             (running (seq-filter (lambda (checker)
                                    (not (memq checker finished)))
                                  enabled))
             (disabled (flymake-disabled-backends)))
        (cond
         (running
          'running)
         (finished
          'finished)
         (disabled
          'all-disabled)
         (t
          'no-checker))))

    (defun koek-ml/get-flymake-n-diags ()
      "Return number of diagnosis per type of error."
      (thread-last (hash-table-values flymake--backend-state)
        (seq-mapcat #'flymake--backend-state-diags)
        (seq-group-by (lambda (diag)
                        (flymake--lookup-type-property (flymake--diag-type diag)
                                                       'flymake-category)))
        (mapcar (pcase-lambda (`(,cat . ,diags))
                  (cons cat (length diags))))))

    (defconst koek-ml/flymake
      '(:eval
        (when (and (bound-and-true-p flymake-mode) (moody-window-active-p))
          `("" koek-ml/separator
            ,(when-let ((name
                         ;; First enabled checker
                         (alist-get (car (reverse (flymake-running-backends)))
                                    koek-ml/checker-names)))
               (concat name " "))
            ,(pcase (koek-ml/get-flymake-state)
               (`running
                "- -")
               (`finished
                (let ((n-diags (koek-ml/get-flymake-n-diags)))
                  (mapconcat
                   (lambda (cat)
                     (propertize
                      (number-to-string (alist-get cat n-diags 0))
                      'face (flymake--lookup-type-property cat 'mode-line-face)))
                   '(flymake-error flymake-warning) " ")))
               (state
                (koek-ml/state-to-description state))))))
      "Flymake mode line construct.")

    (defconst koek-ml/vc
      '(:eval
        (when (and (bound-and-true-p vc-mode) (moody-window-active-p))
          (let ((state (string-trim (substring-no-properties vc-mode))))
            ;; For format, see `vc-default-mode-line-string'
            (string-match
             (rx (submatch-n 1 (one-or-more (not (any "-:@!?")))) (any "-:@!?")
                 (zero-or-one (not (any ":")) ":")
                 (submatch-n 2 (one-or-more not-newline)))
             state)
            `("" koek-ml/separator
              ,(format "%s %s" (match-string 1 state) (match-string 2 state))))))
      "Version control mode line construct.")

    (defconst koek-ml/task
      '(:eval
        (when (and (org-clock-is-active) (moody-window-active-p))
          `("" koek-ml/separator
            ,(org-duration-from-minutes (org-clock-get-clocked-time)))))
      "Task mode line construct.")

    (defconst koek-ml/modes
      '("" koek-ml/separator "(" mode-name mode-line-process minor-mode-alist ")")
      "Modes mode line construct.")

    ;; ediff
    (defconst koek-ml/diff
      '(:eval
        `("" koek-ml/large-separator
          ,(let ((diff-n (1+ ediff-current-difference))
                 (n-diffs ediff-number-of-differences))
             (cond
              ((< diff-n 1)
               (format "Start -/%d" n-diffs))
              ((> diff-n n-diffs)
               (format "End -/%d" n-diffs))
              (t
               (format "%d/%d" diff-n n-diffs))))))
      "Ediff diff mode line construct.")

    (defvar koek-ml/variant-types '(A B C Ancestor)
      "List of variant types.")

    (defun koek-ml/get-variant-state (type)
      "Return state of variant type TYPE for current diff.
  TYPE is a symbol, the variant type, see `koek-ml/variant-types'."
      (when (ediff-valid-difference-p)
        (let* ((diff
                (let ((diff
                       (if (eq type 'Ancestor)
                           (ediff-get-state-of-merge ediff-current-difference)
                         (ediff-get-state-of-diff ediff-current-difference
                                                  type))))
                  (pcase diff
                    ("prefer-A"
                     "=B")
                    ("prefer-B"
                     "=A")
                    ("=diff(A)"
                     "=A")
                    ("=diff(B)"
                     "=B")
                    ("=diff(C)"
                     "=C")
                    ("=diff(A+B)"
                     "=A+B"))))
               (merge (when (eq type 'C)
                        (ediff-get-state-of-merge ediff-current-difference)))
               (ancestor
                (when (eq type 'C)
                  (and (ediff-get-state-of-ancestor ediff-current-difference)
                       "empty")))
               (state (concat diff
                              (when (and diff merge)
                                ":")
                              merge
                              (when (and (or diff merge) ancestor)
                                ":")
                              ancestor)))
          (unless (string-empty-p state)
            state))))

    (define-advice ediff-refresh-mode-lines
        (:override () koek-ml/update-variants)
      (setq mode-line-format
            `(,@koek-ml/dummies " "
              koek-ml/eldoc koek-ml/ace koek-ml/depth
              koek-ml/exwm-workspaces koek-ml/eyebrowse
              koek-ml/id koek-ml/keycast koek-ml/diff koek-ml/task koek-ml/modes))
      (force-mode-line-update)
      (dolist (type koek-ml/variant-types)
        (when-let ((buffer (ediff-get-buffer type)))
          (let ((state (koek-ml/get-variant-state type)))
            (with-current-buffer buffer
              (setq koek-ml/variant
                    (list :label (or (and (eq type 'Ancestor) "Anc")
                                     (symbol-name type))
                          :state state))
              (force-mode-line-update))))))

    (defun koek-ml/cleanup-variants ()
      "Cleanup variants."
      (dolist (type koek-ml/variant-types)
        (when-let ((buffer (ediff-get-buffer type)))
          (with-current-buffer buffer
            (kill-local-variable 'koek-ml/variant)
            (force-mode-line-update)))))

    (add-hook 'ediff-cleanup-hook #'koek-ml/cleanup-variants)
    :config
    (setq x-underline-at-descent-line t)
    (setq moody-mode-line-height 24)
    (setq-default mode-line-format
                  `(,@koek-ml/dummies " "
                    koek-ml/eldoc koek-ml/ace koek-ml/ediff
                    koek-ml/depth koek-ml/exwm-workspaces koek-ml/eyebrowse
                    koek-ml/id koek-ml/state keycast-marker
                    koek-ml/position koek-ml/pdf koek-ml/exwm-input koek-ml/input
                    koek-ml/flymake koek-ml/vc koek-ml/task koek-ml/modes)))
#+END_SRC

Disable blink cursor mode.

#+BEGIN_SRC emacs-lisp
  (blink-cursor-mode 0)
#+END_SRC

